<h1>第3章 分组<span class="tocSkip"></span></h1>
<div class="toc"><ul class="toc-item"><li><span><a href="#第3章-分组" data-toc-modified-id="第3章-分组-1">第3章 分组</a></span></li><li><span><a href="#一.-SAC过程" data-toc-modified-id="一.-SAC过程-2">一. SAC过程</a></span><ul class="toc-item"><li><span><a href="#1.1-内涵" data-toc-modified-id="1.1-内涵-2.1">1.1 内涵</a></span></li><li><span><a href="#1.2-apply过程" data-toc-modified-id="1.2-apply过程-2.2">1.2 apply过程</a></span></li></ul></li><li><span><a href="#二、groupby函数" data-toc-modified-id="二、groupby函数-3">二、groupby函数</a></span><ul class="toc-item"><li><span><a href="#2.1.-分组函数的基本内容：" data-toc-modified-id="2.1.-分组函数的基本内容：-3.1">2.1. 分组函数的基本内容：</a></span><ul class="toc-item"><li><span><a href="#2.1.1-根据某一列分组get_group()" data-toc-modified-id="2.1.1-根据某一列分组get_group()-3.1.1">2.1.1 根据某一列分组get_group()</a></span></li><li><span><a href="#2.1.2-根据某几列分组get_group(())" data-toc-modified-id="2.1.2-根据某几列分组get_group(())-3.1.2">2.1.2 根据某几列分组get_group(())</a></span></li><li><span><a href="#2.1.3-组容量与组数.size()-.ngroups" data-toc-modified-id="2.1.3-组容量与组数.size()-.ngroups-3.1.3">2.1.3 组容量与组数.size() .ngroups</a></span></li><li><span><a href="#2.1.4-组的遍历" data-toc-modified-id="2.1.4-组的遍历-3.1.4">2.1.4 组的遍历</a></span></li><li><span><a href="#2.1.5-level参数（用于多级索引）和axis参数" data-toc-modified-id="2.1.5-level参数（用于多级索引）和axis参数-3.1.5">2.1.5 level参数（用于多级索引）和axis参数</a></span></li></ul></li><li><span><a href="#2.2.-groupby对象的特点" data-toc-modified-id="2.2.-groupby对象的特点-3.2">2.2. groupby对象的特点</a></span><ul class="toc-item"><li><span><a href="#2.2.1（a）查看所有可调用的方法" data-toc-modified-id="2.2.1（a）查看所有可调用的方法-3.2.1">2.2.1（a）查看所有可调用的方法</a></span><ul class="toc-item"><li><span><a href="#由此可见，groupby对象可以使用相当多的函数，灵活程度很高" data-toc-modified-id="由此可见，groupby对象可以使用相当多的函数，灵活程度很高-3.2.1.1">由此可见，groupby对象可以使用相当多的函数，灵活程度很高</a></span></li></ul></li><li><span><a href="#2.2.2（b）分组对象的head和first" data-toc-modified-id="2.2.2（b）分组对象的head和first-3.2.2">2.2.2（b）分组对象的head和first</a></span><ul class="toc-item"><li><span><a href="#对分组对象使用head函数，返回的是每个组的前几行，而不是数据集前几行" data-toc-modified-id="对分组对象使用head函数，返回的是每个组的前几行，而不是数据集前几行-3.2.2.1">对分组对象使用head函数，返回的是每个组的前几行，而不是数据集前几行</a></span></li><li><span><a href="#first显示的是以分组为索引的每组的第一个分组信息" data-toc-modified-id="first显示的是以分组为索引的每组的第一个分组信息-3.2.2.2">first显示的是以分组为索引的每组的第一个分组信息</a></span></li></ul></li><li><span><a href="#2.2.3（c）分组依据" data-toc-modified-id="2.2.3（c）分组依据-3.2.3">2.2.3（c）分组依据</a></span><ul class="toc-item"><li><span><a href="#对于groupby函数而言，分组的依据是非常自由的，只要是与数据框长度相同的列表即可，同时支持函数型分组" data-toc-modified-id="对于groupby函数而言，分组的依据是非常自由的，只要是与数据框长度相同的列表即可，同时支持函数型分组-3.2.3.1">对于groupby函数而言，分组的依据是非常自由的，只要是与数据框长度相同的列表即可，同时支持函数型分组</a></span></li><li><span><a href="#从原理上说，我们可以看到利用函数时，传入的对象就是索引，因此根据这一特性可以做一些复杂的操作" data-toc-modified-id="从原理上说，我们可以看到利用函数时，传入的对象就是索引，因此根据这一特性可以做一些复杂的操作-3.2.3.2">从原理上说，我们可以看到利用函数时，传入的对象就是索引，因此根据这一特性可以做一些复杂的操作</a></span></li><li><span><a href="#根据奇偶行分组" data-toc-modified-id="根据奇偶行分组-3.2.3.3">根据奇偶行分组</a></span></li><li><span><a href="#如果是多层索引，那么lambda表达式中的输入就是元组，下面实现的功能为查看两所学校中男女生分别均分是否及格" data-toc-modified-id="如果是多层索引，那么lambda表达式中的输入就是元组，下面实现的功能为查看两所学校中男女生分别均分是否及格-3.2.3.4">如果是多层索引，那么lambda表达式中的输入就是元组，下面实现的功能为查看两所学校中男女生分别均分是否及格</a></span></li><li><span><a href="#注意：此处只是演示groupby的用法，实际操作不会这样写" data-toc-modified-id="注意：此处只是演示groupby的用法，实际操作不会这样写-3.2.3.5">注意：此处只是演示groupby的用法，实际操作不会这样写</a></span></li></ul></li><li><span><a href="#2.3.4（d）groupby的[]操作" data-toc-modified-id="2.3.4（d）groupby的[]操作-3.2.4">2.3.4（d）groupby的[]操作</a></span><ul class="toc-item"><li><span><a href="#可以用[]选出groupby对象的某个或者某几个列，上面的均分比较可以如下简洁地写出：" data-toc-modified-id="可以用[]选出groupby对象的某个或者某几个列，上面的均分比较可以如下简洁地写出：-3.2.4.1">可以用[]选出groupby对象的某个或者某几个列，上面的均分比较可以如下简洁地写出：</a></span></li><li><span><a href="#用列表可选出多个属性列：" data-toc-modified-id="用列表可选出多个属性列：-3.2.4.2">用列表可选出多个属性列：</a></span></li></ul></li><li><span><a href="#2.3.5（e）连续型变量分组" data-toc-modified-id="2.3.5（e）连续型变量分组-3.2.5">2.3.5（e）连续型变量分组</a></span><ul class="toc-item"><li><span><a href="#例如利用cut函数对数学成绩分组：" data-toc-modified-id="例如利用cut函数对数学成绩分组：-3.2.5.1">例如利用cut函数对数学成绩分组：</a></span></li></ul></li></ul></li></ul></li><li><span><a href="#三、聚合、过滤和变换" data-toc-modified-id="三、聚合、过滤和变换-4">三、聚合、过滤和变换</a></span><ul class="toc-item"><li><span><a href="#3.1.-聚合（Aggregation）" data-toc-modified-id="3.1.-聚合（Aggregation）-4.1">3.1. 聚合（Aggregation）</a></span><ul class="toc-item"><li><span><a href="#3.1.1（a）常用聚合函数" data-toc-modified-id="3.1.1（a）常用聚合函数-4.1.1">3.1.1（a）常用聚合函数</a></span><ul class="toc-item"><li><span><a href="#所谓聚合就是把一堆数，变成一个标量，因此mean/sum/size/count/std/var/sem/describe/first/last/nth/min/max都是聚合函数" data-toc-modified-id="所谓聚合就是把一堆数，变成一个标量，因此mean/sum/size/count/std/var/sem/describe/first/last/nth/min/max都是聚合函数-4.1.1.1">所谓聚合就是把一堆数，变成一个标量，因此mean/sum/size/count/std/var/sem/describe/first/last/nth/min/max都是聚合函数</a></span></li><li><span><a href="#为了熟悉操作，不妨验证标准误sem函数，它的计算公式是：$\frac{组内标准差}{\sqrt{组容量}}$，下面进行验证：" data-toc-modified-id="为了熟悉操作，不妨验证标准误sem函数，它的计算公式是：$\frac{组内标准差}{\sqrt{组容量}}$，下面进行验证：-4.1.1.2">为了熟悉操作，不妨验证标准误sem函数，它的计算公式是：$\frac{组内标准差}{\sqrt{组容量}}$，下面进行验证：</a></span></li></ul></li><li><span><a href="#3.1.2（b）同时使用多个聚合函数" data-toc-modified-id="3.1.2（b）同时使用多个聚合函数-4.1.2">3.1.2（b）同时使用多个聚合函数</a></span><ul class="toc-item"><li><span><a href="#利用元组进行重命名" data-toc-modified-id="利用元组进行重命名-4.1.2.1">利用元组进行重命名</a></span></li><li><span><a href="#指定哪些函数作用哪些列" data-toc-modified-id="指定哪些函数作用哪些列-4.1.2.2">指定哪些函数作用哪些列</a></span></li></ul></li><li><span><a href="#3.1.2（c）使用自定义函数" data-toc-modified-id="3.1.2（c）使用自定义函数-4.1.3">3.1.2（c）使用自定义函数</a></span><ul class="toc-item"><li><span><a href="#官方没有提供极差计算的函数，但通过agg可以容易地实现组内极差计算" data-toc-modified-id="官方没有提供极差计算的函数，但通过agg可以容易地实现组内极差计算-4.1.3.1">官方没有提供极差计算的函数，但通过agg可以容易地实现组内极差计算</a></span></li></ul></li><li><span><a href="#3.1.4（d）利用NamedAgg函数进行多个聚合" data-toc-modified-id="3.1.4（d）利用NamedAgg函数进行多个聚合-4.1.4">3.1.4（d）利用NamedAgg函数进行多个聚合</a></span><ul class="toc-item"><li><span><a href="#注意：不支持lambda函数，但是可以使用外置的def函数" data-toc-modified-id="注意：不支持lambda函数，但是可以使用外置的def函数-4.1.4.1">注意：不支持lambda函数，但是可以使用外置的def函数</a></span></li></ul></li><li><span><a href="#3.1.5（e）带参数的聚合函数" data-toc-modified-id="3.1.5（e）带参数的聚合函数-4.1.5">3.1.5（e）带参数的聚合函数</a></span><ul class="toc-item"><li><span><a href="#判断是否组内数学分数至少有一个值在50-52之间：" data-toc-modified-id="判断是否组内数学分数至少有一个值在50-52之间：-4.1.5.1">判断是否组内数学分数至少有一个值在50-52之间：</a></span></li><li><span><a href="#如果需要使用多个函数，并且其中至少有一个带参数，则使用wrap技巧：" data-toc-modified-id="如果需要使用多个函数，并且其中至少有一个带参数，则使用wrap技巧：-4.1.5.2">如果需要使用多个函数，并且其中至少有一个带参数，则使用wrap技巧：</a></span></li></ul></li></ul></li><li><span><a href="#3.2.-过滤（Filteration）" data-toc-modified-id="3.2.-过滤（Filteration）-4.2">3.2. 过滤（Filteration）</a></span><ul class="toc-item"><li><ul class="toc-item"><li><span><a href="#filter函数是用来筛选某些组的（务必记住结果是组的全体），因此传入的值应当是布尔标量" data-toc-modified-id="filter函数是用来筛选某些组的（务必记住结果是组的全体），因此传入的值应当是布尔标量-4.2.0.1">filter函数是用来筛选某些组的（务必记住结果是组的全体），因此传入的值应当是布尔标量</a></span></li></ul></li></ul></li><li><span><a href="#3.3.-变换（Transformation）" data-toc-modified-id="3.3.-变换（Transformation）-4.3">3.3. 变换（Transformation）</a></span><ul class="toc-item"><li><span><a href="#3.3.1（a）传入对象" data-toc-modified-id="3.3.1（a）传入对象-4.3.1">3.3.1（a）传入对象</a></span><ul class="toc-item"><li><span><a href="#transform函数中传入的对象是组内的列，并且返回值需要与列长完全一致" data-toc-modified-id="transform函数中传入的对象是组内的列，并且返回值需要与列长完全一致-4.3.1.1">transform函数中传入的对象是组内的列，并且返回值需要与列长完全一致</a></span></li><li><span><a href="#如果返回了标量值，那么组内的所有元素会被广播为这个值" data-toc-modified-id="如果返回了标量值，那么组内的所有元素会被广播为这个值-4.3.1.2">如果返回了标量值，那么组内的所有元素会被广播为这个值</a></span></li></ul></li><li><span><a href="#3.3.2（b）利用变换方法进行组内标准化" data-toc-modified-id="3.3.2（b）利用变换方法进行组内标准化-4.3.2">3.3.2（b）利用变换方法进行组内标准化</a></span></li><li><span><a href="#3.3.3（c）利用变换方法进行组内缺失值的均值填充" data-toc-modified-id="3.3.3（c）利用变换方法进行组内缺失值的均值填充-4.3.3">3.3.3（c）利用变换方法进行组内缺失值的均值填充</a></span></li></ul></li></ul></li><li><span><a href="#四、apply函数" data-toc-modified-id="四、apply函数-5">四、apply函数</a></span><ul class="toc-item"><li><span><a href="#4.1.-apply函数的灵活性" data-toc-modified-id="4.1.-apply函数的灵活性-5.1">4.1. apply函数的灵活性</a></span><ul class="toc-item"><li><ul class="toc-item"><li><span><a href="#可能在所有的分组函数中，apply是应用最为广泛的，这得益于它的灵活性：" data-toc-modified-id="可能在所有的分组函数中，apply是应用最为广泛的，这得益于它的灵活性：-5.1.0.1">可能在所有的分组函数中，apply是应用最为广泛的，这得益于它的灵活性：</a></span></li><li><span><a href="#对于传入值而言，从下面的打印内容可以看到是以分组的表传入apply中：" data-toc-modified-id="对于传入值而言，从下面的打印内容可以看到是以分组的表传入apply中：-5.1.0.2">对于传入值而言，从下面的打印内容可以看到是以分组的表传入apply中：</a></span></li><li><span><a href="#apply函数的灵活性很大程度来源于其返回值的多样性：" data-toc-modified-id="apply函数的灵活性很大程度来源于其返回值的多样性：-5.1.0.3">apply函数的灵活性很大程度来源于其返回值的多样性：</a></span></li></ul></li><li><span><a href="#4.1.1-标量返回值" data-toc-modified-id="4.1.1-标量返回值-5.1.1">4.1.1 标量返回值</a></span></li><li><span><a href="#4.1.2-列表返回值" data-toc-modified-id="4.1.2-列表返回值-5.1.2">4.1.2 列表返回值</a></span></li><li><span><a href="#4.1.3-数据框返回值" data-toc-modified-id="4.1.3-数据框返回值-5.1.3">4.1.3 数据框返回值</a></span></li></ul></li><li><span><a href="#4.2.-用apply同时统计多个指标" data-toc-modified-id="4.2.-用apply同时统计多个指标-5.2">4.2. 用apply同时统计多个指标</a></span><ul class="toc-item"><li><ul class="toc-item"><li><span><a href="#此处可以借助OrderedDict工具进行快捷的统计：" data-toc-modified-id="此处可以借助OrderedDict工具进行快捷的统计：-5.2.0.1">此处可以借助OrderedDict工具进行快捷的统计：</a></span></li></ul></li></ul></li></ul></li><li><span><a href="#五、问题与练习" data-toc-modified-id="五、问题与练习-6">五、问题与练习</a></span><ul class="toc-item"><li><span><a href="#5.1.-问题" data-toc-modified-id="5.1.-问题-6.1">5.1. 问题</a></span><ul class="toc-item"><li><span><a href="#5.1.1【问题一】-什么是fillna的前向/后向填充，如何实现？" data-toc-modified-id="5.1.1【问题一】-什么是fillna的前向/后向填充，如何实现？-6.1.1">5.1.1【问题一】 什么是fillna的前向/后向填充，如何实现？</a></span></li><li><span><a href="#5.1.2-【问题二】-下面的代码实现了什么功能？请仿照设计一个它的groupby版本。" data-toc-modified-id="5.1.2-【问题二】-下面的代码实现了什么功能？请仿照设计一个它的groupby版本。-6.1.2">5.1.2 【问题二】 下面的代码实现了什么功能？请仿照设计一个它的groupby版本。</a></span><ul class="toc-item"><li><span><a href="#【问题三】-如何计算组内0.25分位数与0.75分位数？要求显示在同一张表上。" data-toc-modified-id="【问题三】-如何计算组内0.25分位数与0.75分位数？要求显示在同一张表上。-6.1.2.1">【问题三】 如何计算组内0.25分位数与0.75分位数？要求显示在同一张表上。</a></span></li><li><span><a href="#【问题四】-既然索引已经能够选出某些符合条件的子集，那么filter函数的设计有什么意义？" data-toc-modified-id="【问题四】-既然索引已经能够选出某些符合条件的子集，那么filter函数的设计有什么意义？-6.1.2.2">【问题四】 既然索引已经能够选出某些符合条件的子集，那么filter函数的设计有什么意义？</a></span></li><li><span><a href="#【问题五】-整合、变换、过滤三者在输入输出和功能上有何异同？" data-toc-modified-id="【问题五】-整合、变换、过滤三者在输入输出和功能上有何异同？-6.1.2.3">【问题五】 整合、变换、过滤三者在输入输出和功能上有何异同？</a></span></li><li><span><a href="#【问题六】-在带参数的多函数聚合时，有办法能够绕过wrap技巧实现同样功能吗？" data-toc-modified-id="【问题六】-在带参数的多函数聚合时，有办法能够绕过wrap技巧实现同样功能吗？-6.1.2.4">【问题六】 在带参数的多函数聚合时，有办法能够绕过wrap技巧实现同样功能吗？</a></span></li></ul></li></ul></li><li><span><a href="#5.2.-练习" data-toc-modified-id="5.2.-练习-6.2">5.2. 练习</a></span><ul class="toc-item"><li><span><a href="#5.2.1【练习一】：-现有一份关于diamonds的数据集，列分别记录了克拉数、颜色、开采深度、价格，请解决下列问题：" data-toc-modified-id="5.2.1【练习一】：-现有一份关于diamonds的数据集，列分别记录了克拉数、颜色、开采深度、价格，请解决下列问题：-6.2.1">5.2.1【练习一】： 现有一份关于diamonds的数据集，列分别记录了克拉数、颜色、开采深度、价格，请解决下列问题：</a></span><ul class="toc-item"><li><span><a href="#5.2.1.1-(a)-在所有重量超过1克拉的钻石中，价格的极差是多少？" data-toc-modified-id="5.2.1.1-(a)-在所有重量超过1克拉的钻石中，价格的极差是多少？-6.2.1.1">5.2.1.1 (a) 在所有重量超过1克拉的钻石中，价格的极差是多少？</a></span></li><li><span><a href="#5.2.1.2-(b)-若以开采深度的0.2\0.4\0.6\0.8分位数为分组依据，每一组中钻石颜色最多的是哪一种？该种颜色是组内平均而言单位重量最贵的吗？" data-toc-modified-id="5.2.1.2-(b)-若以开采深度的0.2\0.4\0.6\0.8分位数为分组依据，每一组中钻石颜色最多的是哪一种？该种颜色是组内平均而言单位重量最贵的吗？-6.2.1.2">5.2.1.2 (b) 若以开采深度的0.2\0.4\0.6\0.8分位数为分组依据，每一组中钻石颜色最多的是哪一种？该种颜色是组内平均而言单位重量最贵的吗？</a></span></li><li><span><a href="#5.2.1.3-(c)-以重量分组(0-0.5,0.5-1,1-1.5,1.5-2,2+)，按递增的深度为索引排序，求每组中连续的严格递增价格序列长度的最大值。" data-toc-modified-id="5.2.1.3-(c)-以重量分组(0-0.5,0.5-1,1-1.5,1.5-2,2+)，按递增的深度为索引排序，求每组中连续的严格递增价格序列长度的最大值。-6.2.1.3">5.2.1.3 (c) 以重量分组(0-0.5,0.5-1,1-1.5,1.5-2,2+)，按递增的深度为索引排序，求每组中连续的严格递增价格序列长度的最大值。</a></span></li><li><span><a href="#5.2.1.4-(d)-请按颜色分组，分别计算价格关于克拉数的回归系数。（单变量的简单线性回归，并只使用Pandas和Numpy完成）" data-toc-modified-id="5.2.1.4-(d)-请按颜色分组，分别计算价格关于克拉数的回归系数。（单变量的简单线性回归，并只使用Pandas和Numpy完成）-6.2.1.4">5.2.1.4 (d) 请按颜色分组，分别计算价格关于克拉数的回归系数。（单变量的简单线性回归，并只使用Pandas和Numpy完成）</a></span></li></ul></li><li><span><a href="#5.2.2-【练习二】：有一份关于美国10年至17年的非法药物数据集，列分别记录了年份、州（5个）、县、药物类型、报告数量，请解决下列问题：" data-toc-modified-id="5.2.2-【练习二】：有一份关于美国10年至17年的非法药物数据集，列分别记录了年份、州（5个）、县、药物类型、报告数量，请解决下列问题：-6.2.2">5.2.2 【练习二】：有一份关于美国10年至17年的非法药物数据集，列分别记录了年份、州（5个）、县、药物类型、报告数量，请解决下列问题：</a></span><ul class="toc-item"><li><span><a href="#5.2.2.1-(a)-按照年份统计，哪个县的报告数量最多？这个县所属的州在当年也是报告数最多的吗？" data-toc-modified-id="5.2.2.1-(a)-按照年份统计，哪个县的报告数量最多？这个县所属的州在当年也是报告数最多的吗？-6.2.2.1">5.2.2.1 (a) 按照年份统计，哪个县的报告数量最多？这个县所属的州在当年也是报告数最多的吗？</a></span></li><li><span><a href="#5.2.2.2-(b)-从14年到15年，Heroin的数量增加最多的是哪一个州？它在这个州是所有药物中增幅最大的吗？若不是，请找出符合该条件的药物。" data-toc-modified-id="5.2.2.2-(b)-从14年到15年，Heroin的数量增加最多的是哪一个州？它在这个州是所有药物中增幅最大的吗？若不是，请找出符合该条件的药物。-6.2.2.2">5.2.2.2 (b) 从14年到15年，Heroin的数量增加最多的是哪一个州？它在这个州是所有药物中增幅最大的吗？若不是，请找出符合该条件的药物。</a></span></li></ul></li></ul></li></ul></li></ul></div>

# 第3章 分组

In [1]:
import numpy as np
import pandas as pd
df = pd.read_csv('data/table.csv',index_col='ID')
df.head()

     School Class Gender   Address  Height  Weight  Math Physics
ID
1101    S_1   C_1      M  street_1     173      63  34.0      A+
1102    S_1   C_1      F  street_2     192      73  32.5      B+
1103    S_1   C_1      M  street_2     186      82  87.2      B+
1104    S_1   C_1      F  street_2     167      81  80.4      B-
1105    S_1   C_1      F  street_4     159      64  84.8      B+

# 一. SAC过程
## 1.1 内涵
* SAC指的是分组操作中的split-apply-combine过程
* 其中split指基于某一些规则，将数据拆成若干组，apply是指对每一组独立地使用函数
* combine指将每一组的结果组合成某一类数据结构

## 1.2 apply过程
在该过程中，我们实际往往会遇到四类问题：
* 整合（Aggregation）——即分组计算统计量（如求均值、求每组元素个数）
* 变换（Transformation）——即分组对每个单元的数据进行操作（如元素标准化）
* 过滤（Filtration）——即按照某些规则筛选出一些组（如选出组内某一指标小于50的组）
* 综合问题——即前面提及的三种问题的混合
# 二、groupby函数
## 2.1. 分组函数的基本内容：
### 2.1.1 根据某一列分组get_group()

In [2]:
grouped_single = df.groupby('School')

经过groupby后会生成一个groupby对象，该对象本身不会返回任何东西，只有当相应的方法被调用才会起作用

例如取出某一个组：

In [3]:
grouped_single.get_group('S_1').head()

     School Class Gender   Address  Height  Weight  Math Physics
ID
1101    S_1   C_1      M  street_1     173      63  34.0      A+
1102    S_1   C_1      F  street_2     192      73  32.5      B+
1103    S_1   C_1      M  street_2     186      82  87.2      B+
1104    S_1   C_1      F  street_2     167      81  80.4      B-
1105    S_1   C_1      F  street_4     159      64  84.8      B+

### 2.1.2 根据某几列分组get_group(())

In [4]:
grouped_mul = df.groupby(['School','Class'])
grouped_mul.get_group(('S_2','C_4'))

     School Class Gender   Address  Height  Weight  Math Physics
ID
2401    S_2   C_4      F  street_2     192      62  45.3       A
2402    S_2   C_4      M  street_7     166      82  48.7       B
2403    S_2   C_4      F  street_6     158      60  59.7      B+
2404    S_2   C_4      F  street_2     160      84  67.7       B
2405    S_2   C_4      F  street_6     193      54  47.6       B

### 2.1.3 组容量与组数.size() .ngroups

In [5]:
grouped_single.size()

School
S_1    15
S_2    20
dtype: int64

In [6]:
grouped_mul.size()

School  Class
S_1     C_1      5
        C_2      5
        C_3      5
S_2     C_1      5
        C_2      5
        C_3      5
        C_4      5
dtype: int64

In [7]:
grouped_single.ngroups

2

In [8]:
grouped_mul.ngroups

7

### 2.1.4 组的遍历

In [9]:
for name,group in grouped_single:
    print(name)
    display(group.head())

S_1

     School Class Gender   Address  Height  Weight  Math Physics
ID
1101    S_1   C_1      M  street_1     173      63  34.0      A+
1102    S_1   C_1      F  street_2     192      73  32.5      B+
1103    S_1   C_1      M  street_2     186      82  87.2      B+
1104    S_1   C_1      F  street_2     167      81  80.4      B-
1105    S_1   C_1      F  street_4     159      64  84.8      B+

S_2

     School Class Gender   Address  Height  Weight  Math Physics
ID
2101    S_2   C_1      M  street_7     174      84  83.3       C
2102    S_2   C_1      F  street_6     161      61  50.6      B+
2103    S_2   C_1      M  street_4     157      61  52.5      B-
2104    S_2   C_1      F  street_5     159      97  72.2      B+
2105    S_2   C_1      M  street_4     170      81  34.2       A

### 2.1.5 level参数（用于多级索引）和axis参数

In [10]:
df.set_index(['Gender','School']).groupby(level=1,axis=0).get_group('S_1').head()

              Class   Address  Height  Weight  Math Physics
Gender School
M      S_1      C_1  street_1     173      63  34.0      A+
F      S_1      C_1  street_2     192      73  32.5      B+
M      S_1      C_1  street_2     186      82  87.2      B+
F      S_1      C_1  street_2     167      81  80.4      B-
       S_1      C_1  street_4     159      64  84.8      B+

## 2.2. groupby对象的特点
### 2.2.1（a）查看所有可调用的方法
#### 由此可见，groupby对象可以使用相当多的函数，灵活程度很高

In [11]:
print([attr for attr in dir(grouped_single) if not attr.startswith('_')])

['Address', 'Class', 'Gender', 'Height', 'Math', 'Physics', 'School', 'Weight', 'agg', 'aggregate', 'all', 'any', 'apply', 'backfill', 'bfill', 'boxplot', 'corr', 'corrwith', 'count', 'cov', 'cumcount', 'cummax', 'cummin', 'cumprod', 'cumsum', 'describe', 'diff', 'dtypes', 'expanding', 'ffill', 'fillna', 'filter', 'first', 'get_group', 'groups', 'head', 'hist', 'idxmax', 'idxmin', 'indices', 'last', 'mad', 'max', 'mean', 'median', 'min', 'ndim', 'ngroup', 'ngroups', 'nth', 'nunique', 'ohlc', 'pad', 'pct_change', 'pipe', 'plot', 'prod', 'quantile', 'rank', 'resample', 'rolling', 'sem', 'shift', 'size', 'skew', 'std', 'sum', 'tail', 'take', 'transform', 'tshift', 'var']

### 2.2.2（b）分组对象的head和first
#### 对分组对象使用head函数，返回的是每个组的前几行，而不是数据集前几行

In [12]:
grouped_single.head(2)

     School Class Gender   Address  Height  Weight  Math Physics
ID
1101    S_1   C_1      M  street_1     173      63  34.0      A+
1102    S_1   C_1      F  street_2     192      73  32.5      B+
2101    S_2   C_1      M  street_7     174      84  83.3       C
2102    S_2   C_1      F  street_6     161      61  50.6      B+

#### first显示的是以分组为索引的每组的第一个分组信息

In [13]:
grouped_single.first()

       Class Gender   Address  Height  Weight  Math Physics
School
S_1      C_1      M  street_1     173      63  34.0      A+
S_2      C_1      M  street_7     174      84  83.3       C

### 2.2.3（c）分组依据
#### 对于groupby函数而言，分组的依据是非常自由的，只要是与数据框长度相同的列表即可，同时支持函数型分组

In [14]:
df.groupby(np.random.choice(['a','b','c'],df.shape[0])).get_group('a').head()
#相当于将np.random.choice(['a','b','c'],df.shape[0])当做新的一列进行分组

     School Class Gender   Address  Height  Weight  Math Physics
ID
1102    S_1   C_1      F  street_2     192      73  32.5      B+
1203    S_1   C_2      M  street_6     160      53  58.8      A+
1302    S_1   C_3      F  street_1     175      57  87.7      A-
2102    S_2   C_1      F  street_6     161      61  50.6      B+
2103    S_2   C_1      M  street_4     157      61  52.5      B-

#### 从原理上说，我们可以看到利用函数时，传入的对象就是索引，因此根据这一特性可以做一些复杂的操作

In [15]:
df[:5].groupby(lambda x:print(x)).head(0)

1101
1102
1103
1104
1105

Empty DataFrame
Columns: [School, Class, Gender, Address, Height, Weight, Math, Physics]
Index: []

#### 根据奇偶行分组

In [16]:
df.groupby(lambda x:'奇数行' if not df.index.get_loc(x)%2==1 else '偶数行').groups

{'偶数行': Int64Index([1102, 1104, 1201, 1203, 1205, 1302, 1304, 2101, 2103, 2105, 2202,
             2204, 2301, 2303, 2305, 2402, 2404],
            dtype='int64', name='ID'),
 '奇数行': Int64Index([1101, 1103, 1105, 1202, 1204, 1301, 1303, 1305, 2102, 2104, 2201,
             2203, 2205, 2302, 2304, 2401, 2403, 2405],
            dtype='int64', name='ID')}

#### 如果是多层索引，那么lambda表达式中的输入就是元组，下面实现的功能为查看两所学校中男女生分别均分是否及格
#### 注意：此处只是演示groupby的用法，实际操作不会这样写

In [17]:
math_score = df.set_index(['Gender','School'])['Math'].sort_index()
grouped_score = df.set_index(['Gender','School']).sort_index().\
            groupby(lambda x:(x,'均分及格' if math_score[x].mean()>=60 else '均分不及格'))
for name,_ in grouped_score:print(name)

(('F', 'S_1'), '均分及格')
(('F', 'S_2'), '均分及格')
(('M', 'S_1'), '均分及格')
(('M', 'S_2'), '均分不及格')

### 2.3.4（d）groupby的[]操作
#### 可以用[]选出groupby对象的某个或者某几个列，上面的均分比较可以如下简洁地写出：

In [18]:
df.groupby(['Gender','School'])['Math'].mean()>=60

Gender  School
F       S_1        True
        S_2        True
M       S_1        True
        S_2       False
Name: Math, dtype: bool

#### 用列表可选出多个属性列：

In [19]:
df.groupby(['Gender','School'])[['Math','Height']].mean()

                    Math      Height
Gender School
F      S_1     64.100000  173.125000
       S_2     66.427273  173.727273
M      S_1     63.342857  178.714286
       S_2     51.155556  172.000000

### 2.3.5（e）连续型变量分组
#### 例如利用cut函数对数学成绩分组：

In [20]:
bins = [0,40,60,80,90,100]
cuts = pd.cut(df['Math'],bins=bins) #可选label添加自定义标签
df.groupby(cuts)['Math'].count()

Math
(0, 40]       7
(40, 60]     10
(60, 80]      9
(80, 90]      7
(90, 100]     2
Name: Math, dtype: int64

# 三、聚合、过滤和变换
## 3.1. 聚合（Aggregation）
### 3.1.1（a）常用聚合函数
#### 所谓聚合就是把一堆数，变成一个标量，因此mean/sum/size/count/std/var/sem/describe/first/last/nth/min/max都是聚合函数
#### 为了熟悉操作，不妨验证标准误sem函数，它的计算公式是：$\frac{组内标准差}{\sqrt{组容量}}$，下面进行验证：

In [21]:
group_m = grouped_single['Math']
group_m.std().values/np.sqrt(group_m.count().values)== group_m.sem().values

array([ True,  True])

### 3.1.2（b）同时使用多个聚合函数

In [22]:
group_m.agg(['sum','mean','std'])

           sum       mean        std
School
S_1      956.2  63.746667  23.077474
S_2     1191.1  59.555000  17.589305

#### 利用元组进行重命名

In [23]:
group_m.agg([('rename_sum','sum'),('rename_mean','mean')])

        rename_sum  rename_mean
School
S_1          956.2    63.746667
S_2         1191.1    59.555000

#### 指定哪些函数作用哪些列

In [24]:
grouped_mul.agg({'Math':['mean','max'],'Height':'var'})

               Math       Height
               mean   max    var
School Class
S_1    C_1    63.78  87.2  183.3
       C_2    64.30  97.0  132.8
       C_3    63.16  87.7  179.2
S_2    C_1    58.56  83.3   54.7
       C_2    62.80  85.4  256.0
       C_3    63.06  95.5  205.7
       C_4    53.80  67.7  300.2

### 3.1.2（c）使用自定义函数

In [25]:
grouped_single['Math'].agg(lambda x:print(x.head(),'间隔'))
#可以发现，agg函数的传入是分组逐列进行的，有了这个特性就可以做许多事情

1101    34.0
1102    32.5
1103    87.2
1104    80.4
1105    84.8
Name: Math, dtype: float64 间隔
2101    83.3
2102    50.6
2103    52.5
2104    72.2
2105    34.2
Name: Math, dtype: float64 间隔

School
S_1    None
S_2    None
Name: Math, dtype: object

#### 官方没有提供极差计算的函数，但通过agg可以容易地实现组内极差计算

In [26]:
grouped_single['Math'].agg(lambda x:x.max()-x.min())

School
S_1    65.5
S_2    62.8
Name: Math, dtype: float64

### 3.1.4（d）利用NamedAgg函数进行多个聚合
#### 注意：不支持lambda函数，但是可以使用外置的def函数

In [28]:
def R1(x):
    return x.max()-x.min()
def R2(x):
    return x.max()-x.median()
grouped_single['Math'].agg(range_score1=pd.NamedAgg(column='col1', aggfunc=R1),
                           max_score1=pd.NamedAgg(column='col2', aggfunc='max'),
                           range_score2=pd.NamedAgg(column='col3', aggfunc=R2)).head()

        range_score1  max_score1  range_score2
School
S_1             65.5        97.0          33.5
S_2             62.8        95.5          39.4

### 3.1.5（e）带参数的聚合函数
#### 判断是否组内数学分数至少有一个值在50-52之间：

In [29]:
def f(s,low,high):
    return s.between(low,high).max()
grouped_single['Math'].agg(f,50,52)

School
S_1    False
S_2     True
Name: Math, dtype: bool

#### 如果需要使用多个函数，并且其中至少有一个带参数，则使用wrap技巧：

In [30]:
def f_test(s,low,high):
    return s.between(low,high).max()
def agg_f(f_mul,name,*args,**kwargs):
    def wrapper(x):
        return f_mul(x,*args,**kwargs)
    wrapper.__name__ = name
    return wrapper
new_f = agg_f(f_test,'at_least_one_in_50_52',50,52)
grouped_single['Math'].agg([new_f,'mean']).head()

        at_least_one_in_50_52       mean
School
S_1                     False  63.746667
S_2                      True  59.555000

## 3.2. 过滤（Filteration）
#### filter函数是用来筛选某些组的（务必记住结果是组的全体），因此传入的值应当是布尔标量

In [31]:
grouped_single[['Math','Physics']].filter(lambda x:(x['Math']>32).all()).head()

      Math Physics
ID
2101  83.3       C
2102  50.6      B+
2103  52.5      B-
2104  72.2      B+
2105  34.2       A

In [39]:
grouped_single[['Math','Physics']].filter(lambda x:print(x))

Math Physics
ID
1101  34.0      A+
1102  32.5      B+
1103  87.2      B+
1104  80.4      B-
1105  84.8      B+
1201  97.0      A-
1202  63.5      B-
1203  58.8      A+
1204  33.8       B
1205  68.4      B-
1301  31.5      B+
1302  87.7      A-
1303  49.7       B
1304  85.2       A
1305  61.7      B-
      Math Physics
ID
2101  83.3       C
2102  50.6      B+
2103  52.5      B-
2104  72.2      B+
2105  34.2       A
2201  39.1       B
2202  68.5      B+
2203  73.8      A+
2204  47.2      B-
2205  85.4       B
2301  72.3      B+
2302  32.7       A
2303  65.9       C
2304  95.5      A-
2305  48.9       B
2401  45.3       A
2402  48.7       B
2403  59.7      B+
2404  67.7       B
2405  47.6       B

Empty DataFrame
Columns: [Math, Physics]
Index: []

In [44]:
(grouped_single.get_group('S_1')['Math']>32)

ID
1101     True
1102     True
1103     True
1104     True
1105     True
1201     True
1202     True
1203     True
1204     True
1205     True
1301    False
1302     True
1303     True
1304     True
1305     True
Name: Math, dtype: bool

In [43]:
(grouped_single.get_group('S_1')['Math']>32).all()

False

## 3.3. 变换（Transformation）
### 3.3.1（a）传入对象
#### transform函数中传入的对象是组内的列，并且返回值需要与列长完全一致

In [32]:
grouped_single[['Math','Height']].transform(lambda x:x-x.min()).head()

      Math  Height
ID
1101   2.5      14
1102   1.0      33
1103  55.7      27
1104  48.9       8
1105  53.3       0

#### 如果返回了标量值，那么组内的所有元素会被广播为这个值

In [33]:
grouped_single[['Math','Height']].transform(lambda x:x.mean()).head()

           Math      Height
ID
1101  63.746667  175.733333
1102  63.746667  175.733333
1103  63.746667  175.733333
1104  63.746667  175.733333
1105  63.746667  175.733333

### 3.3.2（b）利用变换方法进行组内标准化

In [45]:
grouped_single[['Math','Height']].transform(lambda x:(x-x.mean())/x.std()).head()

          Math    Height
ID
1101 -1.288991 -0.214991
1102 -1.353990  1.279460
1103  1.016287  0.807528
1104  0.721627 -0.686923
1105  0.912289 -1.316166

### 3.3.3（c）利用变换方法进行组内缺失值的均值填充

In [47]:
df_nan = df[['Math','School']].copy().reset_index()
df_nan.loc[np.random.randint(0,df.shape[0],25),['Math']]=np.nan
df_nan.head()

     ID  Math School
0  1101  34.0    S_1
1  1102   NaN    S_1
2  1103   NaN    S_1
3  1104  80.4    S_1
4  1105  84.8    S_1

In [48]:
df_nan.groupby('School').transform(lambda x: x.fillna(x.mean())).join(df.reset_index()['School']).head()

     ID       Math School
0  1101  34.000000    S_1
1  1102  67.922222    S_1
2  1103  67.922222    S_1
3  1104  80.400000    S_1
4  1105  84.800000    S_1

# 四、apply函数

## 4.1. apply函数的灵活性
#### 可能在所有的分组函数中，apply是应用最为广泛的，这得益于它的灵活性：
#### 对于传入值而言，从下面的打印内容可以看到是以分组的表传入apply中：

In [49]:
df.groupby('School').apply(lambda x:print(x.head(1)))

School Class Gender   Address  Height  Weight  Math Physics
ID
1101    S_1   C_1      M  street_1     173      63  34.0      A+
     School Class Gender   Address  Height  Weight  Math Physics
ID
2101    S_2   C_1      M  street_7     174      84  83.3       C

Empty DataFrame
Columns: []
Index: []

#### apply函数的灵活性很大程度来源于其返回值的多样性：
### 4.1.1 标量返回值

In [50]:
df[['School','Math','Height']].groupby('School').apply(lambda x:x.max())

       School  Math  Height
School
S_1       S_1  97.0     195
S_2       S_2  95.5     194

### 4.1.2 列表返回值

In [51]:
df[['School','Math','Height']].groupby('School').apply(lambda x:x-x.min()).head()

      Math  Height
ID
1101   2.5    14.0
1102   1.0    33.0
1103  55.7    27.0
1104  48.9     8.0
1105  53.3     0.0

### 4.1.3 数据框返回值

In [52]:
df[['School','Math','Height']].groupby('School')\
    .apply(lambda x:pd.DataFrame({'col1':x['Math']-x['Math'].max(),
                                  'col2':x['Math']-x['Math'].min(),
                                  'col3':x['Height']-x['Height'].max(),
                                  'col4':x['Height']-x['Height'].min()})).head()

      col1  col2  col3  col4
ID
1101 -63.0   2.5   -22    14
1102 -64.5   1.0    -3    33
1103  -9.8  55.7    -9    27
1104 -16.6  48.9   -28     8
1105 -12.2  53.3   -36     0

## 4.2. 用apply同时统计多个指标
#### 此处可以借助OrderedDict工具进行快捷的统计：

In [53]:
from collections import OrderedDict
def f(df):
    data = OrderedDict()
    data['M_sum'] = df['Math'].sum()
    data['W_var'] = df['Weight'].var()
    data['H_mean'] = df['Height'].mean()
    return pd.Series(data)
grouped_single.apply(f)

         M_sum       W_var      H_mean
School
S_1      956.2  117.428571  175.733333
S_2     1191.1  181.081579  172.950000

# 五、问题与练习

## 5.1. 问题

### 5.1.1【问题一】 什么是fillna的前向/后向填充，如何实现？

### 5.1.2 【问题二】 下面的代码实现了什么功能？请仿照设计一个它的groupby版本。

In [54]:
s = pd.Series ([0, 1, 1, 0, 1, 1, 1, 0])
s1 = s.cumsum()
# 函数的功能是返回给定axis上的累计和
result = s.mul(s1).diff().where(lambda x: x < 0).ffill().add(s1,fill_value =0)

In [55]:
result

0    0.0
1    1.0
2    2.0
3    0.0
4    1.0
5    2.0
6    3.0
7    0.0
dtype: float64

In [61]:
s.mul(s1).diff().where(lambda x: x < 0).ffill()

0    NaN
1    NaN
2    NaN
3   -2.0
4   -2.0
5   -2.0
6   -2.0
7   -5.0
dtype: float64

#### 【问题三】 如何计算组内0.25分位数与0.75分位数？要求显示在同一张表上。
#### 【问题四】 既然索引已经能够选出某些符合条件的子集，那么filter函数的设计有什么意义？
#### 【问题五】 整合、变换、过滤三者在输入输出和功能上有何异同？
#### 【问题六】 在带参数的多函数聚合时，有办法能够绕过wrap技巧实现同样功能吗？

## 5.2. 练习
### 5.2.1【练习一】： 现有一份关于diamonds的数据集，列分别记录了克拉数、颜色、开采深度、价格，请解决下列问题：

In [62]:
pd.read_csv('data/Diamonds.csv').head()

   carat color  depth  price
0   0.23     E   61.5    326
1   0.21     E   59.8    326
2   0.23     E   56.9    327
3   0.29     I   62.4    334
4   0.31     J   63.3    335

In [63]:
df = pd.read_csv('data/Diamonds.csv')
df.head()

   carat color  depth  price
0   0.23     E   61.5    326
1   0.21     E   59.8    326
2   0.23     E   56.9    327
3   0.29     I   62.4    334
4   0.31     J   63.3    335

#### 5.2.1.1 (a) 在所有重量超过1克拉的钻石中，价格的极差是多少？

In [64]:
df_r = df.query('carat>1')['price']
df_r.max()-df_r.min()

17561

In [ ]:
极差为17561

#### 5.2.1.2 (b) 若以开采深度的0.2\0.4\0.6\0.8分位数为分组依据，每一组中钻石颜色最多的是哪一种？该种颜色是组内平均而言单位重量最贵的吗？

In [65]:
bins = df['depth'].quantile(np.linspace(0,1,6)).tolist()
cuts = pd.cut(df['depth'],bins=bins) #可选label添加自定义标签
df['cuts'] = cuts
df.head()

   carat color  depth  price          cuts
0   0.23     E   61.5    326  (60.8, 61.6]
1   0.21     E   59.8    326  (43.0, 60.8]
2   0.23     E   56.9    327  (43.0, 60.8]
3   0.29     I   62.4    334  (62.1, 62.7]
4   0.31     J   63.3    335  (62.7, 79.0]

In [66]:
color_result = df.groupby('cuts')['color'].describe()
color_result

              count unique top  freq
cuts
(43.0, 60.8]  11294      7   E  2259
(60.8, 61.6]  11831      7   G  2593
(61.6, 62.1]  10403      7   G  2247
(62.1, 62.7]  10137      7   G  2193
(62.7, 79.0]  10273      7   G  2000

前三个分位数区间不满足条件，后两个区间中数量最多的颜色的确是均重价格中最贵的

In [67]:
df['均重价格']=df['price']/df['carat']
color_result['top'] == [i[1] for i in df.groupby(['cuts'
                                ,'color'])['均重价格'].mean().groupby(['cuts']).idxmax().values]

cuts
(43.0, 60.8]    False
(60.8, 61.6]    False
(61.6, 62.1]    False
(62.1, 62.7]     True
(62.7, 79.0]     True
Name: top, dtype: bool

0-0.2分位数区间最多的为‘E’，其余区间都为‘G’

#### 5.2.1.3 (c) 以重量分组(0-0.5,0.5-1,1-1.5,1.5-2,2+)，按递增的深度为索引排序，求每组中连续的严格递增价格序列长度的最大值。

In [68]:
df = df.drop(columns='均重价格')
cuts = pd.cut(df['carat'],bins=[0,0.5,1,1.5,2,np.inf]) #可选label添加自定义标签
df['cuts'] = cuts
df.head()

   carat color  depth  price        cuts
0   0.23     E   61.5    326  (0.0, 0.5]
1   0.21     E   59.8    326  (0.0, 0.5]
2   0.23     E   56.9    327  (0.0, 0.5]
3   0.29     I   62.4    334  (0.0, 0.5]
4   0.31     J   63.3    335  (0.0, 0.5]

In [69]:
def f(nums):
    if not nums:        
        return 0
    res = 1                            
    cur_len = 1                        
    for i in range(1, len(nums)):      
        if nums[i-1] < nums[i]:        
            cur_len += 1                
            res = max(cur_len, res)     
        else:                       
            cur_len = 1                 
    return res

In [70]:
for name,group in df.groupby('cuts'):
    group = group.sort_values(by='depth')
    s = group['price']
    print(name,f(s.tolist()))

(0.0, 0.5] 8
(0.5, 1.0] 8
(1.0, 1.5] 7
(1.5, 2.0] 11
(2.0, inf] 7

#### 5.2.1.4 (d) 请按颜色分组，分别计算价格关于克拉数的回归系数。（单变量的简单线性回归，并只使用Pandas和Numpy完成）

In [71]:
for name,group in df[['carat','price','color']].groupby('color'):
    L1 = np.array([np.ones(group.shape[0]),group['carat']]).reshape(2,group.shape[0])
    L2 = group['price']
    result = (np.linalg.inv(L1.dot(L1.T)).dot(L1)).dot(L2).reshape(2,1)
    print('当颜色为%s时，截距项为：%f，回归系数为：%f'%(name,result[0],result[1]))

当颜色为D时，截距项为：-2361.017152，回归系数为：8408.353126
当颜色为E时，截距项为：-2381.049600，回归系数为：8296.212783
当颜色为F时，截距项为：-2665.806191，回归系数为：8676.658344
当颜色为G时，截距项为：-2575.527643，回归系数为：8525.345779
当颜色为H时，截距项为：-2460.418046，回归系数为：7619.098320
当颜色为I时，截距项为：-2878.150356，回归系数为：7761.041169
当颜色为J时，截距项为：-2920.603337，回归系数为：7094.192092

### 5.2.2 【练习二】：有一份关于美国10年至17年的非法药物数据集，列分别记录了年份、州（5个）、县、药物类型、报告数量，请解决下列问题：

In [72]:
pd.read_csv('data/Drugs.csv').head()

   YYYY State           COUNTY  SubstanceName  DrugReports
0  2010    VA         ACCOMACK   Propoxyphene            1
1  2010    OH            ADAMS       Morphine            9
2  2010    PA            ADAMS      Methadone            2
3  2010    VA  ALEXANDRIA CITY         Heroin            5
4  2010    PA        ALLEGHENY  Hydromorphone            5

In [73]:
df = pd.read_csv('data/Drugs.csv')
df.head()

   YYYY State           COUNTY  SubstanceName  DrugReports
0  2010    VA         ACCOMACK   Propoxyphene            1
1  2010    OH            ADAMS       Morphine            9
2  2010    PA            ADAMS      Methadone            2
3  2010    VA  ALEXANDRIA CITY         Heroin            5
4  2010    PA        ALLEGHENY  Hydromorphone            5

#### 5.2.2.1 (a) 按照年份统计，哪个县的报告数量最多？这个县所属的州在当年也是报告数最多的吗？

In [74]:
idx=pd.IndexSlice
for i in range(2010,2018):
    county = (df.groupby(['COUNTY','YYYY']).sum().loc[idx[:,i],:].idxmax()[0][0])
    state = df.query('COUNTY == "%s"'%county)['State'].iloc[0]
    state_true = df.groupby(['State','YYYY']).sum().loc[idx[:,i],:].idxmax()[0][0]
    if state==state_true:
        print('在%d年，%s县的报告数最多，它所属的州%s也是报告数最多的'%(i,county,state))
    else:
        print('在%d年，%s县的报告数最多，但它所属的州%s不是报告数最多的，%s州报告数最多'%(i,county,state,state_true))

在2010年，PHILADELPHIA县的报告数最多，它所属的州PA也是报告数最多的
在2011年，PHILADELPHIA县的报告数最多，但它所属的州PA不是报告数最多的，OH州报告数最多
在2012年，PHILADELPHIA县的报告数最多，但它所属的州PA不是报告数最多的，OH州报告数最多
在2013年，PHILADELPHIA县的报告数最多，但它所属的州PA不是报告数最多的，OH州报告数最多
在2014年，PHILADELPHIA县的报告数最多，但它所属的州PA不是报告数最多的，OH州报告数最多
在2015年，PHILADELPHIA县的报告数最多，但它所属的州PA不是报告数最多的，OH州报告数最多
在2016年，HAMILTON县的报告数最多，它所属的州OH也是报告数最多的
在2017年，HAMILTON县的报告数最多，它所属的州OH也是报告数最多的

#### 5.2.2.2 (b) 从14年到15年，Heroin的数量增加最多的是哪一个州？它在这个州是所有药物中增幅最大的吗？若不是，请找出符合该条件的药物。

In [75]:
df_b = df[(df['YYYY'].isin([2014,2015]))&(df['SubstanceName']=='Heroin')]
df_add = df_b.groupby(['YYYY','State']).sum()
(df_add.loc[2015]-df_add.loc[2014]).idxmax()

DrugReports    OH
dtype: object

In [76]:
df_b = df[(df['YYYY'].isin([2014,2015]))&(df['State']=='OH')]
df_add = df_b.groupby(['YYYY','SubstanceName']).sum()
display((df_add.loc[2015]-df_add.loc[2014]).idxmax()) #这里利用了索引对齐的特点
display((df_add.loc[2015]/df_add.loc[2014]).idxmax())

DrugReports    Heroin
dtype: object

DrugReports    Acetyl fentanyl
dtype: object

OH州增加最多，Heroin是增量最大的，但增幅最大的是Acetyl fentanyl